#!/bin/sh
#
# Brewfile: Install command-line tools using Homebrew
#
# Tap it: `brew tap Homebrew/bundle`
# Use it: `brew bundle`

tap 'caskroom/homebrew-cask'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/binary'
tap 'homebrew/versions'
tap 'josegonzalez/php'

# Install GNU core utilities (those that come with OS X are outdated)
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'rsync'
brew 'figlet'
brew 'chefdk'
brew 'boot2docker'
brew 'docker'
brew 'docker-machine'
brew 'consul'
brew 'kubernetes-cli'
brew 'packer'

cask 'chefdk'
cask 'vagrant'
cask 'virtualbox'
cask 'vagrant'
cask 'vagrant-manager'
cask 'vmware-fusion'
